<img src="http://imgur.com/1ZcRyrc.png" style="float: left; margin: 20px; height: 55px">

# SQL Exercise 03: Walmart Data

In [1]:
import pandas as pd
import sqlite3
from pandas.io import sql

In [2]:
# Load the Walmart sales and store features data

conn = sqlite3.connect('../assets/db/dat-walmart.db')
walmart_sales = pd.read_csv('../assets/data/walmart_sales.csv')
walmart_sales.head()

   Store  Dept        Date  Weekly_Sales  IsHoliday
0      1     1  2010-02-05      24924.50      False
1      1     1  2010-02-12      46039.49       True
2      1     1  2010-02-19      41595.55      False
3      1     1  2010-02-26      19403.54      False
4      1     1  2010-03-05      21827.90      False

In [3]:
walmart_features = pd.read_csv('../assets/data/features.csv')
walmart_features.head()

,Store,Date,Temperature,Fuel_Price,MarkDown1,MarkDown2,MarkDown3,MarkDown4,MarkDown5,CPI,Unemployment,IsHoliday
0,1,2010-02-05,42.31,2.572,NaN,NaN,NaN,NaN,NaN,211.096358,8.106,False
1,1,2010-02-12,38.51,2.548,NaN,NaN,NaN,NaN,NaN,211.242170,8.106,True
2,1,2010-02-19,39.93,2.514,NaN,NaN,NaN,NaN,NaN,211.289143,8.106,False
3,1,2010-02-26,46.63,2.561,NaN,NaN,NaN,NaN,NaN,211.319643,8.106,False
4,1,2010-03-05,46.50,2.625,NaN,NaN,NaN,NaN,NaN,211.350143,8.106,False

In [4]:
# Create a table for each of those datasets
walmart_sales.to_sql('walmart_sales', index=False, if_exists='replace', con = conn)
walmart_features.to_sql('walmart_features', if_exists='replace', index=False, con=conn)

In [5]:
# Select the store, date and fuel price on days it was over 90 degrees
query = """
SELECT 
Date, Store, Fuel_Price, Temperature
FROM walmart_features
WHERE Temperature > 90
"""
sql.read_sql(query, con = conn).head()

         Date  Store  Fuel_Price  Temperature
0  2011-08-05      1       3.684        91.65
1  2011-08-12      1       3.638        90.76
2  2011-07-29      2       3.682        90.07
3  2011-08-05      2       3.684        93.34
4  2011-08-12      2       3.638        91.58

In [6]:
# Select the store, date and weekly sales and temperature
query = """
SELECT 
s.Store, s.Date, s.Weekly_Sales, f.Temperature
FROM walmart_sales as s
JOIN walmart_features as f
ON s.Store = f.Store and s.Date = f.Date
"""
sql.read_sql(query, con = conn).head()

   Store        Date  Weekly_Sales  Temperature
0      1  2010-02-05      24924.50        42.31
1      1  2010-02-12      46039.49        38.51
2      1  2010-02-19      41595.55        39.93
3      1  2010-02-26      19403.54        46.63
4      1  2010-03-05      21827.90        46.50

In [7]:
# What were average sales on holiday vs. non-holiday sales
query = """
SELECT 
IsHoliday, AVG(Weekly_Sales)
FROM walmart_sales as s
GROUP BY IsHoliday
"""
sql.read_sql(query, con = conn)

   IsHoliday  AVG(Weekly_Sales)
0          0       15901.445069
1          1       17035.823187

In [8]:
# What were average sales on holiday vs. non-holiday sales when the temperature was below 32 degrees
query = """
SELECT 
s.IsHoliday, AVG(s.Weekly_Sales)
FROM walmart_sales as s
JOIN walmart_features as f
ON s.Store = f.Store and s.Date = f.Date
WHERE f.Temperature < 32
GROUP BY s.IsHoliday
"""
sql.read_sql(query, con = conn)

   IsHoliday  AVG(s.Weekly_Sales)
0          0         15275.770307
1          1         15111.471238